[
    {
        "id": 1,
        "title": "Munich Miracle",
        "description": "The 2012 UEFA Champions League final between Chelsea and Bayern Munich, played at the Allianz Arena in Munich, was one of the most exciting in the tournament's history. Bayern dominated much of the match, with Thomas Müller's early goal in the 83rd minute seemingly bringing them closer to victory at home. However, Chelsea, under Roberto Di Matteo, did not give up. Didier Drogba, in a decisive moment, tied the game with a header in the 88th minute, sending the game into extra time. In extra time, both teams had chances, but the resolution came in an epic penalty shoot-out. Petr Čech, Chelsea's Czech goalkeeper, became the hero as he saved a penalty from Arjen Robben. Finally, with the score 4-3 in favour of the Blues, Drogba scored the decisive penalty, giving Chelsea their first Champions League title in their history, a triumph that would forever be etched in the memory of their fans.",
        "cover_photo": "https://img.bleacherreport.net/img/images/photos/002/652/705/hi-res-144812615-didier-drogba-of-chelsea-scores-the-winning-penalty_crop_north.jpg?1386673836&w=3072&h=2048",
        "article_photo": "https://i2-prod.football.london/incoming/article24002790.ece/ALTERNATES/s1200b/0_GettyImages-549375277.jpg",
        "article_photo_caption": "Squad celebrating with the Trophy",
        "date": "May 5, 2012",
        "category": "Matches"
    },
    {
        "id": 2,
        "title": "Leicester City's Fairytale Triumph",
        "description": "The 2015-16 Premier League season witnessed one of the greatest underdog stories in football history as Leicester City defied all odds to claim their first-ever English top-flight title. Under the management of Claudio Ranieri, the Foxes assembled a squad that blended resilience, skill, and determination. Led by inspirational players such as Jamie Vardy, Riyad Mahrez, and N'Golo Kanté, Leicester dominated the league despite being 5000-1 outsiders at the start of the season. Vardy set a new record by scoring in 11 consecutive Premier League matches, while Mahrez dazzled with his creativity and goalscoring ability. Leicester secured the title with two games to spare after Tottenham failed to beat Chelsea, sparking jubilant celebrations across the city. Their triumph was hailed as a modern football miracle, proving that teamwork and belief could overcome financial power in the sport.",
        "cover_photo": "https://i.pinimg.com/736x/a6/a2/69/a6a269b19fe2017ef58030071f2ff2a6.jpg",
        "article_photo": "https://www.si.com/.image/c_fill,w_1200,ar_4:3,f_auto,q_auto,g_auto/MTY4MTA1MDM0MTk0NTYwMzg0/2015-0808-leicester-city-riyad-mahrez-jamie-vardyjpg.jpg",
        "article_photo_caption": "Leicester City players celebrating",
        "date": "May 2, 2016",
        "category": "Teams"
    },
    {
        "id": 3,
        "title": "Reds Epic Revival",
        "description": "In one of the most remarkable comebacks in football history, Liverpool overturned a 3-0 first-leg deficit to defeat Barcelona 4-0 at Anfield in the 2018-19 UEFA Champions League semi-final, securing a 4-3 aggregate victory. The tie seemed over after Barcelona's dominant win at the Camp Nou, but Liverpool, led by Jürgen Klopp, produced an unforgettable night of football. Divock Origi opened the scoring in the 7th minute, and the atmosphere at Anfield grew even more electric when Georginio Wijnaldum scored twice in quick succession to level the aggregate score. Then, in one of the most iconic moments, Origi scored again from a quick corner taken by Trent Alexander-Arnold, completing the stunning turnaround. Barcelona, stunned and unable to respond, were left in disbelief, and Liverpool progressed to the final, where they would later defeat Tottenham Hotspur to win their sixth Champions League title.",
        "cover_photo": "https://www.futbolred.com/files/image_800_600/uploads/2019/05/07/5cd1f16e00a81.jpeg",
        "article_photo": "https://img.jakpost.net/c/2019/05/08/2019_05_08_71728_1557283035._large.jpg",
        "article_photo_caption": "Liverpool players celebrating in front of Anfield crowd",
        "date": "May 7, 2019",
        "category": "Matches"
    },
    {
        "id": 4,
        "title": "The Shared Throne of Milan",
        "description": "In the heart of Milan stands one of football’s most legendary arenas, known by two names: San Siro for AC Milan fans and Giuseppe Meazza for Inter Milan supporters. Since its inauguration, this iconic stadium has been the battleground for countless historic matches, witnessing the triumphs and heartbreaks of both clubs. Home to legendary players and unforgettable moments, its electrifying atmosphere makes it one of the most revered venues in world football. Whether painted in red and black or blue and black, San Siro remains a temple of passion, tradition, and footballing greatness.",
        "cover_photo": "https://www.theneweuropean.co.uk/wp-content/uploads/sites/2/2023/05/GettyImages-1129453765.jpg",
        "article_photo": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2023%2F0512%2Fr1172264_1296x729_16%2D9.jpg",
        "article_photo_caption": "Vibrant night at San Siro, the temple of football",
        "date": "September 19, 1926",
        "category": "Stadiums"
    },
    {
        "id": 5,
        "title": "Pellegrini's Euro Málaga",
        "description": "The 2012-13 UEFA Champions League saw Málaga CF embark on a historic journey that captured the hearts of football fans. Under the tactical guidance of Manuel Pellegrini, the Spanish club defied expectations in their first-ever appearance in the competition. Málaga topped their group undefeated, overcoming European giants like AC Milan. The team was built on a solid defensive foundation, led by Argentine goalkeeper Willy Caballero, who delivered heroic performances throughout the campaign. At the back, Martín Demichelis and Weligton provided leadership and resilience, while fullbacks Jesús Gámez and Eliseu added versatility. In midfield, the creativity of Isco shined, earning him the Golden Boy award as Europe’s best young player. He was supported by the experience of Manuel Iturra and the composure of Jeremy Toulalan. Up front, Joaquín’s dribbling and leadership were crucial, while Julio Baptista and Javier Saviola provided attacking firepower. After eliminating Porto in the Round of 16, Málaga faced Borussia Dortmund in the quarter-finals. A semi-final place seemed secured as they led 2-1 in stoppage time, but two controversial offside goals saw Dortmund pull off a dramatic comeback. Despite the heartbreak, Málaga’s Champions League adventure remains one of the greatest underdog stories in modern football history.",
        "cover_photo": "https://media.squawka.com/images/en/2019/04/09133830/malaga-dortmund-team.jpg",
        "article_photo": "https://statics-maker.llt-services.com/mga/images/2022/12/30/xlarge/c5a3663b-9e08-4bb2-8d6b-4cda7955b7df.jpg",
        "article_photo_caption": "Málaga players celebrating a goal in the Champions League",
        "date": "April 9, 2013",
        "category": "Teams"
    },
    {
        "id": 6,
        "title": "QPR’s Superteam Failure",
        "description": "The 2012-13 Premier League season was supposed to mark the rise of Queens Park Rangers as a competitive force after an ambitious transfer window. However, what followed was one of the most disastrous campaigns in the club’s history. Under manager Mark Hughes, QPR assembled a squad filled with high-profile signings, including Brazilian goalkeeper Júlio César, former Real Madrid midfielder Esteban Granero, and Manchester United legend Park Ji-sung. In attack, they brought in Djibril Cissé and Loïc Rémy, while their defense featured seasoned internationals like José Bosingwa and Christopher Samba. Despite the star power, the team struggled from the start, failing to win any of their first 16 league games. Hughes was sacked in November and replaced by Harry Redknapp, but even his experience could not save them. Dressing room issues, lack of chemistry, and a lack of fighting spirit doomed QPR, who finished 20th with just four wins all season. Relegation was confirmed with three games to spare, making their campaign one of the biggest disappointments in Premier League history.",
        "cover_photo": "https://e0.365dm.com/13/01/1600x900/Park_2883186.jpg?20130108105518",
        "article_photo": "https://facts.net/wp-content/uploads/2023/07/14-facts-about-queens-park-rangers-1690456900.jpg",
        "article_photo_caption": "QPR players looking dejected after another defeat",
        "date": "May 4, 2013",
        "category": "Teams"
    },
    {
        "id": 7,
        "title": "Eden Hazard",
        "description": "Eden Hazard’s career is a tale of breathtaking brilliance and unfulfilled potential. Rising to prominence at Lille, the Belgian winger became one of the most exciting young talents in Europe, leading the French club to a historic Ligue 1 title in 2011. His move to Chelsea in 2012 cemented his status as one of the best players of his generation. With dazzling dribbles, clutch goals, and mesmerizing performances, Hazard was the driving force behind Chelsea’s success, winning two Premier League titles, two Europa Leagues, and numerous individual awards. At his peak, he was often compared to the likes of Lionel Messi and Cristiano Ronaldo, mesmerizing fans with his ability to decide games single-handedly. In 2019, Hazard fulfilled his dream move to Real Madrid for a record fee, expected to be the heir to Ronaldo’s throne. However, injuries and fitness struggles plagued his time in Spain, preventing him from reaching his previous heights. Despite winning multiple trophies, including La Liga and the Champions League, Hazard’s influence on the pitch was minimal compared to his Chelsea days. After years of battling injuries, he retired from professional football in 2023, leaving fans wondering what could have been. Though his Real Madrid chapter ended in disappointment, his legacy as one of the Premier League’s greatest wingers remains undisputed.",
        "cover_photo": "https://images.squarespace-cdn.com/content/v1/6415c251b151c40495b60ce0/77d6f471-6b52-4eba-bc1d-541e4c1674e8/hazard+2.jpeg",
        "article_photo": "https://publish-p47754-e237306.adobeaemcloud.com/adobe/dynamicmedia/deliver/dm-aid--6cd8588e-5715-4e6f-9c4b-366e9f7169ed/_330830698394.app.webp?preferwebp=true",
        "article_photo_caption": "Eden Hazard lifting UEFA Champions League Trophy with Real Madrid",
        "date": "October 10, 2023",
        "category": "Players"
    }
    
]